app/controllers/bears_controller.rb

SELECT  "bears".* FROM "bears"  WHERE "bears"."id" = $1 LIMIT 1  [["id", 2]]
---
	def show
		@bear = Bear.find(params[:id])