app/controllers/sessions_controller.rb

	def create
		user = User.find_by(parent_email: params[:parent_email])
---
SELECT  "users".* FROM "users"  WHERE "users"."parent_email" = 'myrtice@ondricka.name' LIMIT 1